// მასივების დავალება

document.write("4.1 დავალება ---")
// 4.1 - შექმენით მასივი, რომლის პირველი ორი ელემენტი იქნება რიცხვი შემდეგი ორი ელემნტი სტრინგი. 
// რიგით პირველ ელემნტს დაუმატეთ რიგით მეორე ელემნტი და შედეგი გამოიტანეთ ეკრანზე.
var x = [23, 12, "hello", "world"];
document.write(x[1] + x[2]);



document.write("<br>" + "<br>" + "4.2 დავალება ---")
// 4.2 - მოცემულია კოდი, რომელმაც კონსოლზე უნდა გამოიტანოს მასივის ელემნტების ჯამი. 
// აღმოაჩინეთ შეცდომა კოდში.
// let arr = [10, 20, 30, 40, 50];
// console.log(arr[1] + arr[2] + arr[3] + arr[4] + arr[5]); 
// 

let arr = [10, 20, 30, 40, 50];


document.write("მასივებში ნუმერაცია იწყება 0-დან და არა 1-დან" + "<br>" + "სინამდვილეში ჩვენ გვაქვს 5 მასივი 0,1,2,3,4" + "<br>" + "მეხუთე ელემენტი მასივებში არ გვქვს  მისი სწორი კი იქნება შემდეგი" + "<br>")
document.write(arr[0] + arr[1] + arr[2] + arr[3] + arr[4])


document.write("<br>" + "<br>" + "4.3 დავალება ---")
/* 
შექმენით ფუნქცია getFirstToy, ისე რომ დააბრუნოს მასზე გადაცემული toys მასივიდან პირველი ელემენტი.
let toys = ['ოვერბორდი', 'პაზლი', 'Lego', 'Yo-yo'];
*/
let toys = ['ოვერბორდი', 'პაზლი', 'Lego', 'Yo-yo'];
let getFirstToy = toys[0]
document.write(getFirstToy)



document.write("<br>" + "<br>" + "4.3 დავალება ---")
/* მოცემულია მასივი arr. მასივს თავსა და ბოლოში დავამატოთ ახალი ელემენტი, შედეგი კონსოლზე
გამოვიტანოთ.
// let arr = [10, 20, 30, 40, 50]; */
{
    let arr = [10, 20, 30, 40, 50];
    arr.push(60)
    arr.unshift(0)
    document.write(arr)
}



document.write("<br>" + "<br>" + "4.3 დავალება ---")
/* მოცემულია მასივი names. წავშალოთ მასივის პირველი და ბოლო ელემენტი, შედეგი კონსოლზე
გამოვიტანოთ.
let names = ['ხვიჩა', 'გოგა' 'მაკა', 'ანა', 'ინა'] */
let names = ['ხვიჩა', 'გოგა', 'მაკა', 'ანა', 'ინა']
names.shift()
names.pop()
document.write(names)
// .shift - დასაწყისში შლის ხოლო .pop - ბოლოში შლის ელემენტებს


